In [12]:
from psycopg2 import sql
import pandas as pd

## Connecting SQL To Python/Pandas

In [7]:
# Replace these parameters with your actual database credentials
db_user = "postgres"
db_password = "postgres" #Use your own password
db_host = "localhost"  # Usually "localhost" if running locally
db_port = "5432"  # Default is 5432

connection = psycopg2.connect(
    user=db_user,
    password=db_password,
    host=db_host,
    port=db_port
)

In [ ]:
cursor = connection.cursor()

connection.autocommit = True

q = sql.SQL('CREATE DATABASE pysql;')
cursor.execute(q)

cursor.close()
connection.close()

In [9]:
connection = psycopg2.connect(
    user=db_user,
    password=db_password,
    host=db_host,
    port=db_port,
    database="pysql"
)

cursor = connection.cursor()

q = sql.SQL('''CREATE TABLE IF NOT EXISTS students (
    id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    age INTEGER,
    campus_id INTEGER,
    total_grade FLOAT
);''')

cursor.execute(q)
connection.commit()

In [10]:
data_values = [
    ('Rafif Iman', 20, 1, 85.5),
    ('Hana Arisona', 21, 2, 90.2),
    ('Raka Purnomo', 19, 1, 78.9),
    ('Danu Irfansyah', 20, 3, 92.7),
    ('Rachman Ardhi', 22, 2, 88.1)
    ]

insert_query = "INSERT INTO students (name, age, campus_id, total_grade) VALUES (%s,%s,%s,%s)"

cursor.executemany(insert_query, data_values)

connection.commit()

In [11]:
select_query = "select *from students;"

cursor.execute(select_query)

rows = cursor.fetchall()
for i in rows:
    print(i)

(1, 'Rafif Iman', 20, 1, 85.5)
(2, 'Hana Arisona', 21, 2, 90.2)
(3, 'Raka Purnomo', 19, 1, 78.9)
(4, 'Danu Irfansyah', 20, 3, 92.7)
(5, 'Rachman Ardhi', 22, 2, 88.1)

In [13]:
select_query = '''SELECT campus_id, MIN(age) AS min_age, MAX(age) AS max_age
                    FROM students
                    GROUP BY campus_id;'''
df = pd.read_sql_query(select_query, connection)

df

C:\Users\angga\AppData\Local\Temp\ipykernel_11460\1729750494.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(select_query, connection)

   campus_id  min_age  max_age
0          3       20       20
1          2       21       22
2          1       19       20